zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/MC56F82748/drivers/fsl_clock.c
        case kCLOCK_SysClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 2U;
            break;

        case kCLOCK_BusClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 2U;
            if (kCLOCK_Mode_Fast == CLOCK_GetClockMode())
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_Bus2xClk:
            u32Freq = CLOCK_GetMstr2xFreq();
            if (kCLOCK_Mode_Fast == CLOCK_GetClockMode())
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_FlashClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 4U;
            if (kCLOCK_Mode_Fast == CLOCK_GetClockMode())
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_FastIrcClk:
            u32Freq = CLOCK_GetFastIrcFreq();
            break;

        case kCLOCK_SlowIrcClk:
            u32Freq = CLOCK_GetSlowIrcFreq();
            break;

        case kCLOCK_CrystalOscClk:
            u32Freq = CLOCK_GetXtalFreq();
            break;

        case kCLOCK_ExtClk:
            u32Freq = CLOCK_GetExtClockFreq();
            break;

        case kCLOCK_MstrOscClk:
            u32Freq = CLOCK_GetMstrOscFreq();
            break;

        case kCLOCK_PllDiv2Clk:
            u32Freq = CLOCK_GetPllDiv2Freq();
            break;

        default:
            assert(false);
            break;
    }
    return u32Freq;
}

/*!
 * brief Get IP clock frequency.
 *
 * param eIpClkName IP clock name.
 *
 * return The required IP clock's frequency in Hz.
 */
uint32_t CLOCK_GetIpClkSrcFreq(clock_ip_name_t eIpClkName)
{
    uint32_t u32Freq = 0U;
    switch (eIpClkName)
    {
        case kCLOCK_TA0:
        case kCLOCK_TA1:
        case kCLOCK_TA2:
        case kCLOCK_TA3:
            /* Qtimer has various clock source, this function only return bus or bus_2x clock for it. */
            u32Freq = CLOCK_GetFreq(kCLOCK_Bus2xClk);
            if ((SIM->PCR & SIM_PCR_TMR_MASK) == 0U)
            {
                /* Not 2X clock */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_IIC0:
        case kCLOCK_QSPI1:
        case kCLOCK_QSPI0:
        case kCLOCK_DACA:
        case kCLOCK_DACB:
        case kCLOCK_CRC:
        case kCLOCK_CYCADC:
        case kCLOCK_CMPA:
        case kCLOCK_CMPB:
        case kCLOCK_CMPC:
        case kCLOCK_CMPD:
            u32Freq = CLOCK_GetFreq(kCLOCK_BusClk);
            break;

        case kCLOCK_QSCI0:
        case kCLOCK_QSCI1:
            u32Freq = CLOCK_GetQsciFreq(eIpClkName);
            break;

        case kCLOCK_PWMACH0:
        case kCLOCK_PWMACH1:
        case kCLOCK_PWMACH2:
        case kCLOCK_PWMACH3:
            u32Freq = CLOCK_GetFreq(kCLOCK_Bus2xClk);
            if ((SIM->PCR & SIM_PCR_PWM_MASK) == 0U)
            {
                /* Not 2X clock */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_MSCAN:
        case kCLOCK_PIT1:
        case kCLOCK_PIT0:
            /* For these IPs, check IP's RM to know which clock source is selected and
             * get corresponding clock separately */
            break;

        default:
            assert(false);
            break;
    }

    return u32Freq;
}

/*!
 * brief Set Clock IN 0 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin0.
 *
 * param u32Freq Clock IN 0 frequency in Hz.
 */
void CLOCK_SetClkin0Freq(uint32_t u32Freq)
{
    assert(u32Freq != 0U);
    assert(u32Freq <= OCCS_MAX_CLK_IN_FREQ);
    g_u32ClockClkin0Freq = u32Freq;
}

/*!
 * brief Set Clock IN 1 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin1
 *
 * param u32Freq Clock IN 1 frequency in Hz.
 */
void CLOCK_SetClkin1Freq(uint32_t u32Freq)
{
    assert(u32Freq != 0U);
    assert(u32Freq <= OCCS_MAX_CLK_IN_FREQ);
    g_u32ClockClkin1Freq = u32Freq;
}

/*!
 * brief Set crystal oscillator frequency.
 *
 * It is a must to call this function in advance if system is operated by crystal oscillator.
 *
 * param u32Freq Crystal oscillator frequency in Hz.
 */
void CLOCK_SetXtalFreq(uint32_t u32Freq)
{
    assert(u32Freq >= OCCS_MIN_CRYSTAL_FREQ);
    assert(u32Freq <= OCCS_MAX_CRYSTAL_FREQ);
    g_u32ClockXtalFreq = u32Freq;
}

/*!
 * brief Config clock register access protection mode.
 *
 * param psConfig Pointer for protection configuration.
 */
void CLOCK_SetProtectionConfig(clock_protection_config_t *psConfig)
{
    OCCS->PROT =
        OCCS_PROT_FRQEP(psConfig->eFrqEP) | OCCS_PROT_OSCEP(psConfig->eOscEP) | OCCS_PROT_PLLEP(psConfig->ePllEP);
}

/*!
 * brief Config output clock.
 *
 * param psConfig Pointer for clock output configuration.
 */
void CLOCK_SetOutputClockConfig(clock_output_config_t *psConfig)
{
    uint16_t u16Reg;

    assert(NULL != psConfig);

    /* clock output0 and clock output1 share the same divider */
    u16Reg = SIM_CLKOUT_CLKODIV(psConfig->eClkDiv);

    if (psConfig->bClkOut0En)
    {
        u16Reg &= ~((uint16_t)SIM_CLKOUT_CLKDIS0_MASK);
        u16Reg |= SIM_CLKOUT_CLKOSEL0(psConfig->eClkOut0Src);
    }
    else
    {
        u16Reg |= SIM_CLKOUT_CLKDIS0_MASK;
    }

    if (psConfig->bClkOut1En)
    {
        u16Reg &= ~((uint16_t)SIM_CLKOUT_CLKDIS1_MASK);
        u16Reg |= SIM_CLKOUT_CLKOSEL1(psConfig->eClkOut1Src);
    }
    else
    {
        u16Reg |= SIM_CLKOUT_CLKDIS1_MASK;
    }

    SIM->CLKOUT = u16Reg;
}

/*!
 * brief Config mcu operation clock.
 *
 * param psConfig Pointer for clock configuration.
 */
void CLOCK_SetClkConfig(clock_config_t *psConfig)
{
    /* sysClkSrc switch back to mstr_osc */
    OCCS->CTRL &= ~((uint16_t)OCCS_CTRL_ZSRC_MASK);

    /* wait the switch done */
    while ((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(kCLOCK_Mstr2xClkSrcMstrOsc))
    {
    }

    /* disable PLL */
    OCCS->CTRL |= OCCS_CTRL_PLLPD_MASK;

    /* Enable clock firstly */
    if (psConfig->bFircEnable)
    {
        OCCS->OSCTL1 &= ~((uint16_t)OCCS_OSCTL1_ROPD_MASK);
        if (psConfig->eFircSel == kCLOCK_FircSel_8M)
        {
            OCCS->OSCTL1 &= ~((uint16_t)OCCS_OSCTL1_ROSB_MASK);
        }
        else
        {
            /* kCLOCK_FircSel_400K */
            OCCS->OSCTL1 |= OCCS_OSCTL1_ROSB_MASK;
        }
    }

    if (psConfig->bSircEnable)
    {
        OCCS->OSCTL2 &= ~((uint16_t)OCCS_OSCTL2_ROPD200K_MASK);
    }

    if (psConfig->bCrystalOscEnable)
    {
        /* set crystal osc mode */
        if (psConfig->eCrystalOscMode == kCLOCK_CrystalOscModeFSP)
        {
            OCCS->OSCTL1 &= ~((uint16_t)OCCS_OSCTL1_COHL_MASK);
        }
        else
        {
            /* kCLOCK_CrystalOscModeLCP */
            OCCS->OSCTL1 |= OCCS_OSCTL1_COHL_MASK;
        }

